name: "cnclip_text"
backend: "tensorrt"
input [
  {
    name: "text"
    data_type: TYPE_INT32
    dims: [ 1, 52 ]
  }
]
output [
  {
    name: "unnorm_text_features"
    data_type: TYPE_FP32
    dims: [ 1, 768 ]
  }
]
instance_group [
  {
    count: 1
    kind: KIND_GPU
  }
]