name: "cnclip_visual"
backend: "tensorrt"
input [
  {
    name: "image"
    data_type: TYPE_FP32
    dims: [ 1, 3, 224, 224 ]
  }
]
output [
  {
    name: "unnorm_image_features"
    data_type: TYPE_FP32
    dims: [ 1, 768 ]
  }
]
instance_group [
  {
    count: 1
    kind: KIND_GPU
  }
]