name: "altclip_text"
backend: "tensorrt"
input [
  {
    name: "input_ids"
    data_type: TYPE_INT32
    dims: [ 1, 77 ]
  },
  {
    name: "attention_mask"
    data_type: TYPE_INT32
    dims: [ 1, 77 ]
  }
]
output [
  {
    name: "query_embed"
    data_type: TYPE_FP32
    dims: [ -1, -1 ]
  }
]
instance_group [
  {
    count: 1
    kind: KIND_GPU
  }
]